; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_4 ?v4 ?v8)
             (pred_10 ?v11 ?v13)
             (pred_11 ?v4 ?v13)
             (pred_7 ?v6 ?v4 )
	     (pred_3 ?v4)
             (pred_1 ?v2)
             (pred_9 ?v11)
             (pred_12 ?v13)
             (pred_2 ?v4)
             (pred_5 ?v11)
             (pred_6 ?v4)
             (pred_8 ))



(:action op_2
:parameters (?v9 ?v1 ?v10 ?v7)
:precondition (and (pred_1 ?v9) (pred_1 ?v1) (pred_9 ?v10) (pred_12 ?v7)
          (pred_4 ?v9 ?v1) (pred_10 ?v10 ?v7)
                   (pred_11 ?v1 ?v7) (pred_3 ?v9) 
                   (pred_2 ?v1) (pred_5 ?v10))
:effect (and  (pred_6 ?v1) (not (pred_2 ?v1))))


(:action op_3
:parameters (?v9 ?v3)
:precondition (and (pred_1 ?v9) (pred_1 ?v3)
               (pred_3 ?v9) (pred_4 ?v9 ?v3) (pred_6 ?v3))
:effect (and (pred_3 ?v3) (not (pred_3 ?v9))))

(:action op_1
:parameters (?v9 ?v10)
:precondition (and (pred_1 ?v9) (pred_9 ?v10) 
                  (pred_3 ?v9) (pred_7 ?v10 ?v9) (pred_8 ))
:effect (and (pred_5 ?v10)
   (not (pred_7 ?v10 ?v9)) (not (pred_8 ))))


(:action op_5
:parameters (?v9 ?v12 ?v5)
:precondition (and (pred_1 ?v9) (pred_9 ?v12) (pred_9 ?v5)
                  (pred_3 ?v9) (pred_5 ?v5) (pred_7 ?v12 ?v9))
:effect (and (pred_5 ?v12) (pred_7 ?v5 ?v9)
        (not (pred_5 ?v5)) (not (pred_7 ?v12 ?v9))))

(:action op_4
:parameters (?v9 ?v10)
:precondition (and (pred_1 ?v9) (pred_9 ?v10) 
                  (pred_3 ?v9) (pred_5 ?v10))
:effect (and (pred_8 ) (pred_7 ?v10 ?v9) (not (pred_5 ?v10)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_32 obj_11 obj_16 obj_30 obj_10 obj_09 obj_01 obj_28 obj_24 obj_13 obj_06 obj_12 obj_02 obj_25 obj_18 obj_03 obj_27 obj_29 obj_08 obj_15 obj_21 obj_17 obj_07 obj_26 obj_05
    obj_23 obj_14 obj_04
    obj_31 obj_22 obj_19 obj_20
    )

    (:init
       (pred_8)

       (pred_1 obj_32)
       (pred_1 obj_11)
       (pred_1 obj_16)
       (pred_1 obj_30)
       (pred_1 obj_10)
       (pred_1 obj_09)
       (pred_1 obj_01)
       (pred_1 obj_28)
       (pred_1 obj_24)
       (pred_1 obj_13)
       (pred_1 obj_06)
       (pred_1 obj_12)
       (pred_1 obj_02)
       (pred_1 obj_25)
       (pred_1 obj_18)
       (pred_1 obj_03)
       (pred_1 obj_27)
       (pred_1 obj_29)
       (pred_1 obj_08)
       (pred_1 obj_15)
       (pred_1 obj_21)
       (pred_1 obj_17)
       (pred_1 obj_07)
       (pred_1 obj_26)
       (pred_1 obj_05)
       (pred_12 obj_23)
       (pred_12 obj_14)
       (pred_12 obj_04)
       (pred_9 obj_31)
       (pred_9 obj_22)
       (pred_9 obj_19)
       (pred_9 obj_20)

       (pred_4 obj_32 obj_09)
       (pred_4 obj_32 obj_11)
       (pred_4 obj_11 obj_01)
       (pred_4 obj_11 obj_16)
       (pred_4 obj_11 obj_32)
       (pred_4 obj_16 obj_28)
       (pred_4 obj_16 obj_30)
       (pred_4 obj_16 obj_11)
       (pred_4 obj_30 obj_24)
       (pred_4 obj_30 obj_10)
       (pred_4 obj_30 obj_16)
       (pred_4 obj_10 obj_13)
       (pred_4 obj_10 obj_30)
       (pred_4 obj_09 obj_06)
       (pred_4 obj_09 obj_01)
       (pred_4 obj_09 obj_32)
       (pred_4 obj_01 obj_12)
       (pred_4 obj_01 obj_28)
       (pred_4 obj_01 obj_11)
       (pred_4 obj_01 obj_09)
       (pred_4 obj_28 obj_02)
       (pred_4 obj_28 obj_24)
       (pred_4 obj_28 obj_16)
       (pred_4 obj_28 obj_01)
       (pred_4 obj_24 obj_25)
       (pred_4 obj_24 obj_13)
       (pred_4 obj_24 obj_30)
       (pred_4 obj_24 obj_28)
       (pred_4 obj_13 obj_18)
       (pred_4 obj_13 obj_10)
       (pred_4 obj_13 obj_24)
       (pred_4 obj_06 obj_03)
       (pred_4 obj_06 obj_12)
       (pred_4 obj_06 obj_09)
       (pred_4 obj_12 obj_27)
       (pred_4 obj_12 obj_02)
       (pred_4 obj_12 obj_01)
       (pred_4 obj_12 obj_06)
       (pred_4 obj_02 obj_29)
       (pred_4 obj_02 obj_25)
       (pred_4 obj_02 obj_28)
       (pred_4 obj_02 obj_12)
       (pred_4 obj_25 obj_08)
       (pred_4 obj_25 obj_18)
       (pred_4 obj_25 obj_24)
       (pred_4 obj_25 obj_02)
       (pred_4 obj_18 obj_15)
       (pred_4 obj_18 obj_13)
       (pred_4 obj_18 obj_25)
       (pred_4 obj_03 obj_21)
       (pred_4 obj_03 obj_27)
       (pred_4 obj_03 obj_06)
       (pred_4 obj_27 obj_17)
       (pred_4 obj_27 obj_29)
       (pred_4 obj_27 obj_12)
       (pred_4 obj_27 obj_03)
       (pred_4 obj_29 obj_07)
       (pred_4 obj_29 obj_08)
       (pred_4 obj_29 obj_02)
       (pred_4 obj_29 obj_27)
       (pred_4 obj_08 obj_26)
       (pred_4 obj_08 obj_15)
       (pred_4 obj_08 obj_25)
       (pred_4 obj_08 obj_29)
       (pred_4 obj_15 obj_05)
       (pred_4 obj_15 obj_18)
       (pred_4 obj_15 obj_08)
       (pred_4 obj_21 obj_17)
       (pred_4 obj_21 obj_03)
       (pred_4 obj_17 obj_07)
       (pred_4 obj_17 obj_27)
       (pred_4 obj_17 obj_21)
       (pred_4 obj_07 obj_26)
       (pred_4 obj_07 obj_29)
       (pred_4 obj_07 obj_17)
       (pred_4 obj_26 obj_05)
       (pred_4 obj_26 obj_08)
       (pred_4 obj_26 obj_07)
       (pred_4 obj_05 obj_15)
       (pred_4 obj_05 obj_26)
       (pred_2 obj_16)
       (pred_2 obj_21)
       (pred_2 obj_08)
       (pred_2 obj_26)
       (pred_11  obj_16 obj_23)
       (pred_11  obj_21 obj_14)
       (pred_11  obj_08 obj_04)
       (pred_11  obj_26 obj_23)
       (pred_6 obj_32)
       (pred_6 obj_11)
       (pred_6 obj_30)
       (pred_6 obj_10)
       (pred_6 obj_09)
       (pred_6 obj_01)
       (pred_6 obj_28)
       (pred_6 obj_24)
       (pred_6 obj_13)
       (pred_6 obj_06)
       (pred_6 obj_12)
       (pred_6 obj_02)
       (pred_6 obj_25)
       (pred_6 obj_18)
       (pred_6 obj_03)
       (pred_6 obj_27)
       (pred_6 obj_29)
       (pred_6 obj_15)
       (pred_6 obj_17)
       (pred_6 obj_07)
       (pred_6 obj_05)

       (pred_10  obj_31 obj_23)
       (pred_10  obj_22 obj_14)
       (pred_10  obj_19 obj_04)
       (pred_10  obj_20 obj_04)
       (pred_7 obj_31 obj_06)
       (pred_7 obj_22 obj_09)
       (pred_7 obj_19 obj_27)
       (pred_7 obj_20 obj_21)
       (pred_3 obj_28)
    )

    (:goal (and
       (pred_7 obj_31 obj_16)
       (pred_7 obj_22 obj_24)
       (pred_7 obj_19 obj_11)
    ))
(:constraints
  (always (not (pred_3 obj_01)))
)
)

; plan
1. (op_3 obj_28 obj_02)
   deleted: (pred_3 obj_28)
   added: (pred_3 obj_02)
   goals met: 0 of 3
2. (op_3 obj_02 obj_12)
   deleted: (pred_3 obj_02)
   added: (pred_3 obj_12)
   goals met: 0 of 3
3. (op_3 obj_12 obj_27)
   deleted: (pred_3 obj_12)
   added: (pred_3 obj_27)
   goals met: 0 of 3
4. (op_1 obj_27 obj_19)
   deleted: (pred_7 obj_19 obj_27) (pred_8)
   added: (pred_5 obj_19)
   goals met: 0 of 3
5. (op_3 obj_27 obj_12)
   deleted: (pred_3 obj_27)
   added: (pred_3 obj_12)
   goals met: 0 of 3
6. (op_3 obj_12 obj_06)
   deleted: (pred_3 obj_12)
   added: (pred_3 obj_06)
   goals met: 0 of 3
7. (op_3 obj_06 obj_09)
   deleted: (pred_3 obj_06)
   added: (pred_3 obj_09)
   goals met: 0 of 3
8. (op_3 obj_09 obj_32)
   deleted: (pred_3 obj_09)
   added: (pred_3 obj_32)
   goals met: 0 of 3
9. (op_3 obj_32 obj_11)
   deleted: (pred_3 obj_32)
   added: (pred_3 obj_11)
   goals met: 0 of 3
10. (op_4 obj_11 obj_19)
   deleted: (pred_5 obj_19)
   added: (pred_8) (pred_7 obj_19 obj_11)
   goals met: 1 of 3
11. (op_3 obj_11 obj_32)
   deleted: (pred_3 obj_11)
   added: (pred_3 obj_32)
   goals met: 1 of 3
12. (op_3 obj_32 obj_09)
   deleted: (pred_3 obj_32)
   added: (pred_3 obj_09)
   goals met: 1 of 3
13. (op_3 obj_09 obj_06)
   deleted: (pred_3 obj_09)
   added: (pred_3 obj_06)
   goals met: 1 of 3
14. (op_1 obj_06 obj_31)
   deleted: (pred_7 obj_31 obj_06) (pred_8)
   added: (pred_5 obj_31)
   goals met: 1 of 3
15. (op_3 obj_06 obj_12)
   deleted: (pred_3 obj_06)
   added: (pred_3 obj_12)
   goals met: 1 of 3
16. (op_3 obj_12 obj_02)
   deleted: (pred_3 obj_12)
   added: (pred_3 obj_02)
   goals met: 1 of 3
17. (op_3 obj_02 obj_28)
   deleted: (pred_3 obj_02)
   added: (pred_3 obj_28)
   goals met: 1 of 3
18. (op_2 obj_28 obj_16 obj_31 obj_23)
   deleted: (pred_2 obj_16)
   added: (pred_6 obj_16)
   goals met: 1 of 3
19. (op_3 obj_28 obj_16)
   deleted: (pred_3 obj_28)
   added: (pred_3 obj_16)
   goals met: 1 of 3
20. (op_4 obj_16 obj_31)
   deleted: (pred_5 obj_31)
   added: (pred_8) (pred_7 obj_31 obj_16)
   goals met: 2 of 3
21. (op_3 obj_16 obj_11)
   deleted: (pred_3 obj_16)
   added: (pred_3 obj_11)
   goals met: 2 of 3
22. (op_3 obj_11 obj_32)
   deleted: (pred_3 obj_11)
   added: (pred_3 obj_32)
   goals met: 2 of 3
23. (op_3 obj_32 obj_09)
   deleted: (pred_3 obj_32)
   added: (pred_3 obj_09)
   goals met: 2 of 3
24. (op_1 obj_09 obj_22)
   deleted: (pred_7 obj_22 obj_09) (pred_8)
   added: (pred_5 obj_22)
   goals met: 2 of 3
25. (op_3 obj_09 obj_32)
   deleted: (pred_3 obj_09)
   added: (pred_3 obj_32)
   goals met: 2 of 3
26. (op_3 obj_32 obj_11)
   deleted: (pred_3 obj_32)
   added: (pred_3 obj_11)
   goals met: 2 of 3
27. (op_3 obj_11 obj_16)
   deleted: (pred_3 obj_11)
   added: (pred_3 obj_16)
   goals met: 2 of 3
28. (op_3 obj_16 obj_30)
   deleted: (pred_3 obj_16)
   added: (pred_3 obj_30)
   goals met: 2 of 3
29. (op_3 obj_30 obj_24)
   deleted: (pred_3 obj_30)
   added: (pred_3 obj_24)
   goals met: 2 of 3
30. (op_4 obj_24 obj_22)
   deleted: (pred_5 obj_22)
   added: (pred_8) (pred_7 obj_22 obj_24)
   goals met: 3 of 3
